{
  "backend/main.mo": "Motoko backend actor implementing outbreak risk prediction using moving averages of environmental data (rainfall, humidity, turbidity, bacteria) with weighted scoring and adjustment factors, returning risk percentage and category (Low/Medium/High).",
  "feature_evidence.json": "Feature evidence report documenting implemented features including RoleSelector label updates, DiseaseClassification component, WardHeatmap 3x3 grid, and intervention priority scoring system with test IDs and confidence levels.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including App, pages, and components with details on role-based rendering, medical analytics styling, risk thresholds (Green <30%, Yellow 30-70%, Red >70%), and EmailJS integration.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark mode CSS variables for medical analytics theme including background, foreground, primary, secondary, destructive, and chart colors.",
  "frontend/index.html": "HTML entry point for the Community Health Sentinel application with root div and module script loading main.tsx.",
  "frontend/src/App.tsx": "Main React application using TanStack Router with routes for landing page and dashboard, implementing role selection state management before allowing dashboard access with selected UserRole.",
  "frontend/src/components/AlertEngine.tsx": "Alert recommendation component displaying color-coded alerts (green/yellow/red) based on risk percentage thresholds (<30%, 30-70%, >70%) with specific action recommendations for each risk level.",
  "frontend/src/components/AlertHistory.tsx": "Alert history table component with ward and risk level filtering, displaying stored alert records from localStorage with timestamp, ward, risk level badges, probability, and recommended actions.",
  "frontend/src/components/CaseVolumeProjection.tsx": "Displays a 7-day case volume projection table based on risk category (low/moderate/high), generating simulated daily case counts with upward trends and variance.",
  "frontend/src/components/DataFreshnessFooter.tsx": "Renders a footer showing the current date/time as 'Last Updated' and lists simulated data sources for environmental monitoring.",
  "frontend/src/components/DiseaseClassification.tsx": "Visualizes disease risk distribution (Cholera, Typhoid, Dysentery, Hepatitis A) using horizontal bar and pie charts with probability percentages, highlighting the highest-risk disease.",
  "frontend/src/components/DistrictRiskOverview.tsx": "Displays four summary cards showing district risk index, high-risk ward count, monsoon impact level, and system operational status.",
  "frontend/src/components/EmergencyAlertDispatch.tsx": "Empty file with no content.",
  "frontend/src/components/ExplainableAI.tsx": "Shows factor contribution to outbreak risk using horizontal bar charts for rainfall, humidity, turbidity, and bacteria index with normalized impact percentages.",
  "frontend/src/components/ExportButton.tsx": "Generates and downloads a CSV file containing ward-level risk analysis data including outbreak probability, vulnerability weights, and priority scores.",
  "frontend/src/components/ForecastChart.tsx": "Renders a 14-day predictive risk forecast line chart with confidence score and model AUC metrics, showing trending risk percentages over time.",
  "frontend/src/components/InterventionPriority.tsx": "Displays a prioritized table of wards ranked by intervention urgency, calculated from outbreak probability and vulnerability factors, highlighting top 3 high-priority wards.",
  "frontend/src/components/NearestSupportCenter.tsx": "Displays a card with static information about the nearest health support center, including name, address, phone number, and operating hours with emergency service availability.",
  "frontend/src/components/PatientCaseTrend.tsx": "Renders a line chart showing patient case trends over the last 30 days with generated data that includes realistic variance and occasional spikes.",
  "frontend/src/components/PreventiveRecommendations.tsx": "Displays a card with four preventive health recommendations related to water safety, hygiene, and medical attention, each with an icon.",
  "frontend/src/components/ResourceEstimation.tsx": "Calculates and displays required resources (medical staff, hospital beds, water purification units, chlorination teams) based on risk level and percentage using a bar chart and list view.",
  "frontend/src/components/ResourcePlanning.tsx": "Provides resource planning suggestions for staff allocation, supply management, and bed capacity based on the current risk category (low, moderate, or high).",
  "frontend/src/components/RiskComponentBreakdown.tsx": "Visualizes the weighted contribution of four risk factors (rainfall, humidity, turbidity, bacteria) to overall risk using a bar chart with color-coded components.",
  "frontend/src/components/RiskGauge.tsx": "Displays the current risk level as a percentage with color-coded gauge, progress bar, and risk label (low/medium/high) along with prediction confidence.",
  "frontend/src/components/RiskPredictionPanel.tsx": "Form component for inputting environmental and health parameters to predict cholera risk, with role-specific fields, validation, email alerts, and integration with backend actor for predictions.",
  "frontend/src/components/RoleSelector.tsx": "Landing page component that allows users to select their role (community citizen, healthcare provider, or government authority) to access role-appropriate dashboard views.",
  "frontend/src/components/SafetyAdvisory.tsx": "Displays a safety advisory card with risk-specific icons, colors, and messages for high, moderate, or low cholera outbreak risk categories.",
  "frontend/src/components/SystemArchitecture.tsx": "Collapsible card component showing a vertical flow diagram of the system's architecture layers from user dashboard to cloud infrastructure.",
  "frontend/src/components/WardComparison.tsx": "Bar chart component comparing outbreak probability across 9 wards using Recharts, with color-coded risk levels based on adjusted overall risk values.",
  "frontend/src/components/WardHeatmap.tsx": "Grid-based heatmap displaying outbreak probability for 9 wards in Coimbatore District with color-coded risk levels (green/yellow/red).",
  "frontend/src/components/WardSelector.tsx": "Dropdown selector component for choosing one of 9 wards, marked as required with a red asterisk.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages an ICP backend actor, handling both authenticated and anonymous connections with automatic query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom medical analytics theme defining color variables, typography, shadows, and alert backgrounds in a professional blue/white palette.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page component that renders role-based views (community, healthcare, government) with comprehensive health monitoring features including risk prediction, forecasts, alerts, heatmaps, and various analytics panels organized in tabs.",
  "frontend/src/pages/LandingPage.tsx": "Landing page component with hero section showcasing the AI-powered early warning system, featuring a call-to-action button to launch the dashboard and a grid of four key feature highlights (real-time monitoring, water quality tracking, automated alerts, trending analysis).",
  "frontend/src/services/EmailAlertService.ts": "Mock email alert service with placeholder EmailJS integration that simulates sending alert notifications with risk data; includes configuration placeholders and instructions for enabling real email functionality.",
  "frontend/src/utils/wardDataGenerator.ts": "Utility module that generates deterministic ward-level data (sanitation coverage, water treatment coverage, population density) for 9 wards using seeded pseudo-random number generation based on ward IDs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining the design system with OKLCH color variables, medical theme colors (blue, green, orange, red), custom shadows, border radius values, and responsive container settings for the health monitoring application.",
  "project_state.json": "Project metadata file documenting the Community Health Sentinel system architecture, design system specifications, role-based features, color-coded risk system, and comprehensive list of implemented features for the water-borne disease early warning system."
}