{
  "backend/main.mo": "Motoko backend actor implementing cholera outbreak risk prediction with moving averages over 7-day historical data for rainfall, humidity, turbidity, and bacteria, calculating normalized environmental risk scores with weighted factors and returning risk percentage, category, and message.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features: debugging IC0508 canister rejection errors in GovernmentDataPanel's predictOutbreakRisk calls, and adding comprehensive error handling with user-friendly toast notifications for backend failures.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend components including role-based dashboards, risk visualization panels, ward heatmaps, alert engines, and UI components using white backgrounds with professional blue/yellow/red medical analytics styling and updated 30%/70% risk thresholds.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark mode CSS variables for medical analytics theme including background, foreground, primary, destructive, chart colors, and sidebar styling tokens.",
  "frontend/index.html": "HTML entry point for Community Health Sentinel app with EmailJS SDK integration (public key KHu3JNagtUgZCsDcG) and root div mounting point for React application.",
  "frontend/src/App.tsx": "Main React app with TanStack Router configuration defining root, landing, and dashboard routes with role selection flow (community/healthcare/admin) and global Toaster component for notifications.",
  "frontend/src/components/AlertEngine.tsx": "Alert recommendation component displaying color-coded risk levels (low <30%, moderate 30-70%, high >70%) with specific action items and emergency protocols based on current risk percentage.",
  "frontend/src/components/AlertHistory.tsx": "Alert history table component with ward and risk level filtering, displaying historical alert records from localStorage including timestamps, environmental parameters, risk scores, disease predictions, and recommended actions with color-coded badges.",
  "frontend/src/components/CaseVolumeProjection.tsx": "Displays a 7-day case volume projection table based on risk category (low/moderate/high), generating simulated daily case estimates with upward trends.",
  "frontend/src/components/DataFreshnessFooter.tsx": "Shows the current date, time, and data source information footer indicating when data was last updated.",
  "frontend/src/components/DiseaseClassification.tsx": "Visualizes disease risk distribution (Cholera, Typhoid, Dysentery, Hepatitis A) using bar and pie charts, dynamically updating probabilities based on risk percentage from localStorage and custom events.",
  "frontend/src/components/DistrictRiskOverview.tsx": "Displays four key metrics cards showing district risk index, high-risk wards count, monsoon impact level, and system operational status.",
  "frontend/src/components/EmergencyAlertDispatch.tsx": "Empty component file with no content.",
  "frontend/src/components/ExplainableAI.tsx": "Shows factor contribution analysis with horizontal bars visualizing how rainfall, humidity, turbidity, and bacteria index impact the overall outbreak risk percentage.",
  "frontend/src/components/ExportButton.tsx": "Generates and exports ward-level risk analysis data to CSV, calculating outbreak probability, vulnerability weights, and priority scores for all wards.",
  "frontend/src/components/ForecastChart.tsx": "Renders a 14-day predictive risk forecast line chart with confidence score and model AUC metrics, showing trending risk percentages over time.",
  "frontend/src/components/GovernmentDataPanel.tsx": "Form component for government officials to input environmental data (rainfall, humidity, turbidity, bacteria), infrastructure metrics, and submit reports with risk calculation and email alert capabilities using Internet Computer actor integration.",
  "frontend/src/components/InterventionPriority.tsx": "Displays a table and bar chart ranking wards by intervention priority score, calculated from outbreak probability and vulnerability factors (sanitation, water treatment, population density). Listens for risk data updates via custom events.",
  "frontend/src/components/LastGovernmentReport.tsx": "Shows the most recent government inspection report with timestamp and metrics (water quality, bacteria, turbidity, rainfall, humidity, sanitation/water treatment coverage, risk level). Data is loaded from localStorage or defaults to placeholder values.",
  "frontend/src/components/NearestSupportCenter.tsx": "Displays static contact information for the nearest health support center, including name, address, phone number, and operating hours with emergency service availability.",
  "frontend/src/components/PatientCaseTrend.tsx": "Renders a line chart showing 30 days of patient case trends with generated data that includes realistic variance and occasional spikes.",
  "frontend/src/components/PreventiveRecommendations.tsx": "Lists four preventive health recommendations with icons (boil water, wash hands, avoid street food, seek medical attention) for cholera outbreak prevention.",
  "frontend/src/components/ResourceEstimation.tsx": "Calculates and displays required resources (medical staff, hospital beds, water purification units, chlorination teams) based on risk level and percentage, shown as a bar chart and detailed list.",
  "frontend/src/components/ResourcePlanning.tsx": "Provides resource planning recommendations for staff allocation, supply management, and bed capacity based on risk category (low, moderate, high).",
  "frontend/src/components/RiskComponentBreakdown.tsx": "Visualizes weighted risk contributions from four factors (rainfall 30%, turbidity 25%, contamination 25%, humidity 20%) as a bar chart with normalized input values.",
  "frontend/src/components/RiskGauge.tsx": "Displays a visual risk gauge with percentage, color-coded label (low/medium/high), and progress bar; listens for 'risk-data-updated' custom events to update dynamically.",
  "frontend/src/components/RiskPredictionPanel.tsx": "Form component for inputting environmental and healthcare data (rainfall, humidity, turbidity, bacteria, cases, sanitation, etc.) with validation; calls backend actor to predict cholera outbreak risk and triggers callback on completion.",
  "frontend/src/components/RoleSelector.tsx": "Landing screen with three role cards (Common Citizen, Hospital/PHC, Government Health Authority) that allows users to select their role and navigate to the appropriate dashboard.",
  "frontend/src/components/SafetyAdvisory.tsx": "Displays risk-appropriate safety messages and icons (high/moderate/low) with color-coded alerts and actionable health guidance based on the current risk category.",
  "frontend/src/components/SystemArchitecture.tsx": "Collapsible card showing a vertical flow diagram of the system's four-layer architecture (User Dashboard → Analytics Engine → Predictive Model → Cloud Infrastructure) with deployment notes.",
  "frontend/src/components/WardComparison.tsx": "Bar chart component comparing outbreak probabilities across 9 wards using Recharts; applies adjustment factors to the overall risk and color-codes bars by risk level.",
  "frontend/src/components/WardHeatmap.tsx": "Grid-based heatmap visualizing ward-specific outbreak risks calculated from sanitation, water treatment, population density, and environmental factors; listens for risk and ward data update events.",
  "frontend/src/components/WardSelector.tsx": "Dropdown selector component for choosing one of 9 wards; displays required field indicator and triggers callback on selection change.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with Internet Identity authentication; invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/index.css": "Tailwind CSS configuration with a professional medical analytics theme using blue primary colors, light grey backgrounds, and custom utilities for medical alerts and shadows.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page component with tabbed interface displaying risk predictions, ward heatmaps, forecasts, government data panels, and role-based views for health monitoring.",
  "frontend/src/pages/LandingPage.tsx": "Landing page showcasing the AI-powered early warning system for water-borne diseases with hero section and feature grid highlighting real-time monitoring and automated alerts.",
  "frontend/src/services/EmailAlertService.ts": "Service for sending email alerts via EmailJS with parameter validation, formatting for risk levels, environmental data, and detailed logging for debugging.",
  "frontend/src/utils/wardDataGenerator.ts": "Utility for generating deterministic ward-level data (sanitation coverage, water treatment, population density) using seeded random values based on ward IDs.",
  "frontend/src/utils/wardRiskCalculator.ts": "Utility for calculating ward-specific outbreak risk by applying vulnerability factors (sanitation, water treatment, population density, environmental characteristics) to a base risk value, with normalization to 0-100% range.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining design system with OKLCH color tokens, medical/government theme colors, custom spacing, shadows, and responsive breakpoints for the application UI.",
  "project_state.json": "Project metadata tracking version 29 of Community Health Sentinel, documenting role-based access control (Citizen/Hospital/Government), feature list, architectural design patterns, and known issues for the water-borne disease early warning system."
}