{
  "backend/main.mo": "Motoko actor implementing cholera risk prediction with ward-based data storage, moving average calculations for environmental parameters (rainfall, humidity, turbidity, bacteria), weighted risk scoring with dynamic thresholds, and persistence of predictions mapped by ward keys.",
  "feature_evidence.json": "Feature evidence report documenting four high-confidence features for dynamic disease probability calculation in DiseaseClassification component, event-driven updates from GovernmentDataPanel and RiskPredictionPanel, and event listener implementation for real-time recalculation.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend components including role-based dashboard routing, risk visualization panels, ward heatmaps with localStorage integration, medical analytics styling with professional blue/yellow/red palette, and event-driven architecture for real-time updates.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark mode variables for medical analytics theme, including professional blue primary colors, destructive red, and chart color tokens with sidebar styling.",
  "frontend/index.html": "HTML entry point with EmailJS SDK integration for email notifications, initialized with public key for alert dispatch functionality.",
  "frontend/src/App.tsx": "Root application component using TanStack Router with role-based routing between landing and dashboard pages, role selector integration, and global Toaster component for notifications.",
  "frontend/src/components/AlertEngine.tsx": "Alert recommendation component displaying color-coded risk levels (low <30%, moderate 30-70%, high >70%) with contextual icons, messages, and actionable response protocols for each risk tier.",
  "frontend/src/components/AlertHistory.tsx": "Alert history table component with ward and risk level filtering, displaying historical alert records from localStorage including environmental parameters, risk scores, disease predictions, and recommended actions with formatted timestamps.",
  "frontend/src/components/CaseVolumeProjection.tsx": "Displays a 7-day projection table of expected disease case volumes based on risk category (low/moderate/high), generating simulated estimates with an upward trend.",
  "frontend/src/components/DataFreshnessFooter.tsx": "Renders a footer showing the current date/time as \"Last Updated\" and lists simulated data sources for environmental monitoring.",
  "frontend/src/components/DiseaseClassification.tsx": "Calculates and visualizes disease outbreak probabilities (Cholera, Typhoid, Dysentery, Hepatitis A) using weighted environmental parameters (rainfall, humidity, turbidity, bacteria) with bar and pie charts.",
  "frontend/src/components/DistrictRiskOverview.tsx": "Displays four summary cards showing district-level metrics: overall risk index, high-risk ward count, monsoon impact level, and system operational status.",
  "frontend/src/components/EmergencyAlertDispatch.tsx": "Empty file with no content.",
  "frontend/src/components/ExplainableAI.tsx": "Visualizes the relative contribution of four environmental factors (rainfall, humidity, turbidity, bacteria) to the overall outbreak risk using horizontal bar charts.",
  "frontend/src/components/ExportButton.tsx": "Generates and downloads a CSV file containing ward-level risk analysis data including outbreak probability, vulnerability weights, and infrastructure metrics.",
  "frontend/src/components/ForecastChart.tsx": "Renders a 14-day line chart forecast of disease outbreak risk with confidence score and model AUC metrics, showing a slight upward trend with variance.",
  "frontend/src/components/GovernmentDataPanel.tsx": "Provides a form for government officials to input environmental and infrastructure data (rainfall, humidity, bacteria, sanitation coverage, etc.), calculates 7-day averages, validates inputs, and integrates with backend actor for risk calculation and email alerts.",
  "frontend/src/components/InterventionPriority.tsx": "Displays a table and bar chart ranking wards by intervention priority score, calculated from outbreak probability and vulnerability factors (sanitation, water treatment, population density). Listens for risk data updates via custom events.",
  "frontend/src/components/LastGovernmentReport.tsx": "Shows the most recent government inspection report with timestamp and metrics (water quality, bacteria, turbidity, rainfall, humidity, sanitation/water treatment coverage, risk level). Data is loaded from localStorage or uses default placeholder values.",
  "frontend/src/components/NearestSupportCenter.tsx": "Displays static information about the nearest health support center including name, address, phone number, and operating hours with emergency service availability.",
  "frontend/src/components/PatientCaseTrend.tsx": "Renders a line chart showing 30 days of generated patient case trend data with realistic variance and occasional spikes.",
  "frontend/src/components/PreventiveRecommendations.tsx": "Lists four preventive health recommendations with icons (boil water, wash hands, avoid street food, seek medical attention) for cholera outbreak prevention.",
  "frontend/src/components/ResourceEstimation.tsx": "Calculates and displays required resources (medical staff, hospital beds, water purification units, chlorination teams) based on risk level and percentage, shown in both bar chart and list format.",
  "frontend/src/components/ResourcePlanning.tsx": "Provides resource planning recommendations for staff allocation, supply management, and bed capacity based on risk category (low/moderate/high).",
  "frontend/src/components/RiskComponentBreakdown.tsx": "Visualizes weighted risk contributions from four factors (rainfall 30%, turbidity 25%, contamination 25%, humidity 20%) in a bar chart with normalized values.",
  "frontend/src/components/RiskGauge.tsx": "Displays a visual risk gauge with percentage, color-coded label (low/medium/high), and progress bar; listens for 'risk-data-updated' custom events to update dynamically.",
  "frontend/src/components/RiskPredictionPanel.tsx": "Form component for inputting environmental and healthcare data (rainfall, humidity, turbidity, bacteria index, etc.) with validation; calls backend actor to predict cholera outbreak risk and triggers onPredictionComplete callback.",
  "frontend/src/components/RoleSelector.tsx": "Landing page component that displays three role cards (Common Citizen, Hospital/PHC, Government Health Authority) for user type selection.",
  "frontend/src/components/SafetyAdvisory.tsx": "Displays context-aware safety advisory messages with icons and styling based on risk category (low, moderate, high).",
  "frontend/src/components/SystemArchitecture.tsx": "Collapsible card showing a vertical flow diagram of system architecture layers from user dashboard to cloud infrastructure.",
  "frontend/src/components/WardComparison.tsx": "Bar chart component comparing outbreak probability across 9 wards using Recharts; applies adjustment factors to overall risk and color-codes bars by risk level.",
  "frontend/src/components/WardHeatmap.tsx": "Grid heatmap visualizing risk levels across 9 wards; loads ward-specific data from localStorage or generator, calculates per-ward risk using sanitation/water/population factors, and listens for risk update events.",
  "frontend/src/components/WardSelector.tsx": "Dropdown select component for choosing one of 9 wards; controlled component that calls onWardChange callback.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages backend actor instances with optional Internet Identity authentication; invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/index.css": "Tailwind CSS configuration with a clean white medical analytics theme, defining color variables for light mode (professional blues, greys) and custom utilities for medical UI components.",
  "frontend/src/main.tsx": "Application entry point that renders the root component with QueryClient and InternetIdentityProvider wrappers for React Query and ICP authentication.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page component displaying health risk analytics with multiple tabs (overview, predictions, resources, insights) and role-based content for monitoring water-borne disease risks across wards.",
  "frontend/src/pages/LandingPage.tsx": "Landing page component showcasing the AI-powered early warning system for water-borne diseases with hero section and feature grid highlighting real-time monitoring, water quality tracking, and automated alerts.",
  "frontend/src/services/EmailAlertService.ts": "Service for sending email alerts via EmailJS with template parameter validation, formatting risk data (rainfall, humidity, turbidity, bacteria) and comprehensive error logging.",
  "frontend/src/utils/wardDataGenerator.ts": "Utility for generating deterministic ward-level data (sanitation coverage, water treatment coverage, population density) using seeded pseudo-random values based on ward IDs.",
  "frontend/src/utils/wardRiskCalculator.ts": "Utility for calculating ward-specific outbreak risk by applying vulnerability factors (sanitation, water treatment, population density, environmental characteristics) to a base risk value, with normalization to 0-100% range.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining the design system with OKLCH color variables, medical/government theme colors, custom spacing, shadows, and responsive breakpoints for the application UI.",
  "project_state.json": "Project metadata tracking the Community Health Sentinel system's architecture, role-based access control (Citizen/Hospital/Government), known issues with ward heatmap data persistence, and existing features including dashboard components and risk calculation."
}