{
  "backend/main.mo": "Motoko actor implementing cholera outbreak risk prediction using moving averages of environmental data (rainfall, humidity, turbidity, bacteria) with weighted scoring, normalization, and adjustment factors to calculate risk percentage and category (Low/Medium/High).",
  "feature_evidence.json": "Feature evidence report documenting two requirements: removing the 'Test Email Configuration' button from GovernmentDataPanel (REQ-99) and verifying the 'Update & Recalculate Risk' button functionality with 15 input fields, backend integration, and dashboard updates (REQ-100).",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend components describing a medical analytics dashboard with role-based access, risk visualization components (gauge, heatmap, charts), and a clean white/blue professional theme with updated risk thresholds (Green <30%, Yellow 30-70%, Red >70%).",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining CSS custom properties for light and dark themes, including medical analytics color palette with professional blue, yellow/amber, green, and red colors.",
  "frontend/index.html": "HTML entry point for 'Community Health Sentinel' application that initializes EmailJS SDK with public key for email functionality and loads the React app via main.tsx.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with landing page and dashboard routes, role selection logic (community/healthcare/admin), and global Toaster component for notifications.",
  "frontend/src/components/AlertEngine.tsx": "Alert recommendation component displaying color-coded alert boxes (green/yellow/red) based on risk percentage thresholds (<30%, 30-70%, >70%) with specific action recommendations for each risk level.",
  "frontend/src/components/AlertHistory.tsx": "Alert history table component displaying past risk assessments with filtering by ward and risk level, loading data from localStorage, and showing comprehensive alert records including environmental inputs, risk outputs, and recommended actions.",
  "frontend/src/components/CaseVolumeProjection.tsx": "Displays a 7-day projected case volume table based on risk category (low/moderate/high), generating simulated daily case counts with upward trends and variance.",
  "frontend/src/components/DataFreshnessFooter.tsx": "Shows the current date, time, and data source information footer indicating when the dashboard was last updated.",
  "frontend/src/components/DiseaseClassification.tsx": "Renders bar and pie charts showing disease risk distribution (Cholera, Typhoid, Dysentery, Hepatitis A) with probabilities adjusted based on overall risk percentage from localStorage or custom events.",
  "frontend/src/components/DistrictRiskOverview.tsx": "Displays four metric cards showing district risk index, high-risk ward count, monsoon impact level, and system operational status.",
  "frontend/src/components/EmergencyAlertDispatch.tsx": "Empty component file with no content.",
  "frontend/src/components/ExplainableAI.tsx": "Visualizes AI factor contributions (rainfall, humidity, turbidity, bacteria) to outbreak risk using horizontal progress bars with normalized impact percentages.",
  "frontend/src/components/ExportButton.tsx": "Generates and downloads a CSV file containing ward-level risk analysis data including outbreak probability, vulnerability weights, and infrastructure metrics.",
  "frontend/src/components/ForecastChart.tsx": "Displays a 14-day predictive risk forecast line chart with confidence score and model AUC metrics, generating simulated trend data with variance.",
  "frontend/src/components/GovernmentDataPanel.tsx": "Form component for government officials to input environmental, infrastructure, and health data per ward, with validation, risk calculation via blockchain actor, and email alert functionality.",
  "frontend/src/components/InterventionPriority.tsx": "Displays ward-level intervention priorities by calculating priority scores based on outbreak probability, vulnerability factors (sanitation, water treatment, population density), and overall risk. Includes a sortable table and bar chart visualization.",
  "frontend/src/components/LastGovernmentReport.tsx": "Shows the most recent government inspection report with timestamp and key metrics (water quality, bacteria level, turbidity, rainfall, humidity, sanitation/water treatment coverage, risk level) retrieved from localStorage or default placeholder data.",
  "frontend/src/components/NearestSupportCenter.tsx": "Displays static information about the nearest health support center including name, address, phone number, and operating hours with emergency service availability.",
  "frontend/src/components/PatientCaseTrend.tsx": "Renders a 30-day line chart showing patient case trends with generated data that includes realistic variance and occasional spikes to simulate cholera case patterns.",
  "frontend/src/components/PreventiveRecommendations.tsx": "Lists four preventive health recommendations with icons (boil water, hand washing, avoid street food, seek medical attention) to help prevent cholera infection.",
  "frontend/src/components/ResourceEstimation.tsx": "Calculates and displays required resources (medical staff, hospital beds, water purification units, chlorination teams) based on risk level and percentage using a bar chart and detailed list.",
  "frontend/src/components/ResourcePlanning.tsx": "Provides resource planning recommendations for staff allocation, supply management, and bed capacity based on the current risk category (low, moderate, or high).",
  "frontend/src/components/RiskComponentBreakdown.tsx": "Visualizes the weighted contribution of four risk factors (rainfall 30%, turbidity 25%, contamination 25%, humidity 20%) to overall cholera outbreak risk using a bar chart.",
  "frontend/src/components/RiskGauge.tsx": "Displays a visual gauge showing current cholera outbreak risk percentage with color-coded levels (low/medium/high) and a progress bar. Listens for 'risk-data-updated' custom events to update the displayed risk in real-time.",
  "frontend/src/components/RiskPredictionPanel.tsx": "Form component for inputting environmental parameters (rainfall, humidity, turbidity, bacteria) and healthcare-specific data to predict cholera outbreak risk. Validates inputs, calls backend actor for predictions, and emits results via callback and custom events.",
  "frontend/src/components/RoleSelector.tsx": "Landing page component that displays three role cards (Common Citizen, Hospital/PHC, Government Health Authority) for users to select their dashboard view type. Each role has distinct icons, descriptions, and access levels.",
  "frontend/src/components/SafetyAdvisory.tsx": "Displays contextual safety recommendations based on risk category (low/moderate/high) with appropriate icons, colors, and actionable health guidance messages for cholera prevention.",
  "frontend/src/components/SystemArchitecture.tsx": "Collapsible card component that visualizes the system's four-layer architecture (User Dashboard, Analytics Engine, Predictive Model, Cloud Infrastructure) with a vertical flow diagram and deployment notes.",
  "frontend/src/components/WardComparison.tsx": "Bar chart component comparing cholera outbreak probability across 9 wards using Recharts. Applies adjustment factors to overall risk and color-codes bars based on risk levels.",
  "frontend/src/components/WardHeatmap.tsx": "Grid-based heatmap visualizing ward-specific cholera risk using scientific formulas that factor in sanitation coverage, water treatment, population density, and environmental multipliers. Listens for risk and ward data update events.",
  "frontend/src/components/WardSelector.tsx": "Dropdown selector component for choosing one of 9 wards, with required field validation styling and controlled value management.",
  "frontend/src/hooks/useActor.ts": "React Query hook that manages backend actor instances with Internet Identity authentication. Creates authenticated or anonymous actors based on identity state and invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with AuthClient.",
  "frontend/src/index.css": "Tailwind CSS configuration with a clean white medical analytics theme, defining color variables for light mode (professional blues, greys) and custom utility classes for medical UI elements.",
  "frontend/src/main.tsx": "Application entry point that renders the root component with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page component displaying health risk analytics with tabs for overview, predictions, and reports; includes ward selection, risk gauges, and multiple data visualization panels.",
  "frontend/src/pages/LandingPage.tsx": "Landing page component showcasing the AI-powered early warning system for water-borne diseases with hero section and feature grid highlighting real-time monitoring capabilities.",
  "frontend/src/services/EmailAlertService.ts": "Service for sending email alerts via EmailJS with parameter validation, formatting for risk notifications including environmental data and priority scores.",
  "frontend/src/utils/wardDataGenerator.ts": "Utility for generating deterministic ward-level data (sanitation coverage, water treatment, population density) using seeded pseudo-random values based on ward IDs.",
  "frontend/src/utils/wardRiskCalculator.ts": "Calculates ward-specific outbreak risk by applying vulnerability factors (sanitation coverage, water treatment, population density, environmental multipliers) to a base risk value, normalizing results to 0-100% range.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining design system with OKLCH color tokens, medical/government theme colors, custom spacing, shadows, and responsive container settings for the health monitoring dashboard.",
  "project_state.json": "Project metadata tracking version 27 of Community Health Sentinel system with role-based access (Citizen/Hospital/Government), feature list, architectural notes for medical analytics UI styling, and known issues."
}