{
  "backend/main.mo": "Motoko actor defining predictOutbreakRisk function that normalizes four environmental inputs (rainfall, humidity, turbidity, bacteriaIndex), calculates weighted risk percentage, and returns risk category (Low/Moderate/High).",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: 14-day predictive forecast chart, enhanced risk gauge with color-coded status and confidence label, and automated response recommendation panel with risk-based alerts.",
  "frontend-file-summaries.txt": "JSON object containing one-sentence summaries of all frontend source files including pages, components, and configuration files.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for background, foreground, card, primary, secondary, destructive, border, and chart colors.",
  "frontend/index.html": "HTML entry point with viewport meta tag, title 'Community Health Sentinel', root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "TanStack Router setup defining root route with two child routes: index route (/) rendering LandingPage and dashboard route (/dashboard) rendering DashboardPage.",
  "frontend/src/components/AlertEngine.tsx": "Component displaying color-coded alert cards (red/orange/green) with risk-appropriate titles, messages, and recommended action lists based on riskPercentage thresholds (70%, 40%).",
  "frontend/src/components/DataFreshnessFooter.tsx": "Footer component displaying dynamically formatted last update timestamp and listing three data sources (IMD Rainfall API, Water Quality Sensors, PHC Surveillance Reports).",
  "frontend/src/components/DistrictRiskOverview.tsx": "Four-card grid panel showing District Risk Index percentage, High-Risk Wards count, Monsoon Impact level, and System Status badge with icons and descriptions.",
  "frontend/src/components/ExplainableAI.tsx": "Card component displaying horizontal progress bars for four environmental factors (rainfall, humidity, turbidity, bacteria) with calculated impact percentages and explanatory text about risk drivers.",
  "frontend/src/components/ForecastChart.tsx": "Displays a 14-day predictive forecast line chart using Recharts, showing risk percentage trends with confidence score and model AUC metrics. Generates synthetic forecast data with realistic variance and upward trend.",
  "frontend/src/components/RiskGauge.tsx": "Renders a visual risk gauge component displaying risk percentage with color-coded indicators (green/orange/red), a progress bar, scale labels, and prediction confidence score.",
  "frontend/src/components/RiskPredictionPanel.tsx": "Interactive form component that accepts environmental parameters (rainfall, humidity, turbidity, bacteria index) and calls the backend actor to predict outbreak risk, displaying results via RiskGauge component.",
  "frontend/src/components/WardHeatmap.tsx": "Displays a grid of 8 wards with color-coded risk levels (low/moderate/high) in a heatmap-style layout, including a legend for risk thresholds.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for managing user login/logout state, creating AuthClient with configurable options, and handling identity persistence across page reloads.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom government-themed color palette (dark blue primary, teal accents) for both light and dark modes, including professional typography and smooth transitions.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page component that orchestrates the health intelligence interface, including district risk overview, risk prediction panel, forecast chart, alert engine, ward heatmap, explainable AI, and data freshness footer with navigation and header/footer layout.",
  "frontend/src/pages/LandingPage.tsx": "Landing page component featuring a hero section with AI-powered early warning system messaging, feature grid showcasing real-time monitoring, water quality tracking, automated alerts, and predictive forecasting, with navigation to the dashboard.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color palette (including gov-dark, gov-primary, gov-teal), typography, spacing, border radius, shadows, and theme extensions using OKLCH color space with plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata and state tracking document describing the Community Health Sentinel application architecture, design system (color-coded risk levels, government styling), existing features including landing page, dashboard components, risk prediction, alerts, and ward heatmaps."
}