{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Calculate Disease Risk Distribution dynamically from environmental input data",
  "requirements": [
    {
      "id": "REQ-116",
      "summary": "Update DiseaseClassification component to calculate disease probabilities dynamically based on environmental input data using weighted formulas instead of hardcoded values",
      "acceptanceCriteria": [
        "Disease probabilities update dynamically when risk-data-updated or ward-data-updated events are dispatched",
        "Cholera probability calculation weighs bacteria index and turbidity heavily (e.g., 40% bacteria, 30% turbidity, 20% rainfall, 10% humidity)",
        "Typhoid probability calculation weighs contamination and sanitation factors (e.g., 35% bacteria, 25% turbidity, 25% humidity, 15% rainfall)",
        "Dysentery probability calculation emphasizes water quality and bacteria (e.g., 45% bacteria, 30% turbidity, 15% rainfall, 10% humidity)",
        "Hepatitis A probability calculation weighs sanitation and contamination (e.g., 30% bacteria, 30% turbidity, 25% humidity, 15% rainfall)",
        "All four disease probabilities sum to 100% by normalizing the calculated values",
        "The highest probability disease is highlighted in red as before",
        "Both bar chart and pie chart visualizations update to reflect the calculated probabilities"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/DiseaseClassification.tsx",
          "operation": "modify",
          "description": "Replace hardcoded disease probabilities with dynamic calculation logic. Add a calculateDiseaseProbabilities function that takes environmental parameters (rainfall, humidity, turbidity, bacteriaIndex) and returns normalized probabilities for Cholera (40% bacteria, 30% turbidity, 20% rainfall, 10% humidity), Typhoid (35% bacteria, 25% turbidity, 25% humidity, 15% rainfall), Dysentery (45% bacteria, 30% turbidity, 15% rainfall, 10% humidity), and Hepatitis A (30% bacteria, 30% turbidity, 25% humidity, 15% rainfall). Normalize all four values to sum to exactly 100%. Update the component state to use these calculated values and maintain the existing red highlighting for the highest probability disease. Preserve the existing bar chart and pie chart visualizations."
        }
      ]
    },
    {
      "id": "REQ-117",
      "summary": "Update GovernmentDataPanel to dispatch disease-classification-updated event after successful risk calculation with environmental parameters",
      "acceptanceCriteria": [
        "Custom event is dispatched after successful backend risk calculation",
        "Event detail includes all four environmental parameters with their current values",
        "Event is dispatched from the handleUpdateRisk function after localStorage update"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/GovernmentDataPanel.tsx",
          "operation": "modify",
          "description": "Add a new custom event dispatch in the handleUpdateRisk function after the successful backend call and localStorage update. Dispatch a 'disease-classification-updated' event with detail containing the four environmental parameters: { rainfall, humidity, turbidity, bacteriaIndex }. Ensure the event is dispatched to window so DiseaseClassification can listen for it."
        }
      ]
    },
    {
      "id": "REQ-118",
      "summary": "Update RiskPredictionPanel to dispatch disease-classification-updated event after successful prediction for Hospital/PHC users",
      "acceptanceCriteria": [
        "Event is dispatched after successful backend prediction call",
        "Event includes the environmental parameters used for prediction",
        "Disease classification updates correctly for Hospital/PHC users"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/RiskPredictionPanel.tsx",
          "operation": "modify",
          "description": "Add a new custom event dispatch in the handlePredict function after the successful backend prediction call. Dispatch a 'disease-classification-updated' event with detail containing the four environmental parameters: { rainfall, humidity, turbidity, bacteriaIndex }. Ensure the event is dispatched to window so DiseaseClassification can listen for it across different user roles."
        }
      ]
    },
    {
      "id": "REQ-119",
      "summary": "Add event listener in DiseaseClassification to handle disease-classification-updated events and recalculate probabilities using weighted formulas",
      "acceptanceCriteria": [
        "Event listener is registered on component mount and cleaned up on unmount",
        "Disease probabilities are recalculated using scientifically plausible weighting formulas",
        "All probabilities are normalized to ensure they sum to exactly 100%",
        "Bar chart and pie chart both reflect the updated calculated values",
        "The highest probability disease is correctly highlighted in red"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/DiseaseClassification.tsx",
          "operation": "modify",
          "description": "Add a useEffect hook that registers an event listener for 'disease-classification-updated' events on window. Extract the environmental parameters (rainfall, humidity, turbidity, bacteriaIndex) from event.detail. Call the calculateDiseaseProbabilities function (created in REQ-116) with these parameters to compute the four disease probabilities. Update the component state with the new calculated probabilities, triggering re-render of both bar chart and pie chart. Clean up the event listener on component unmount. Ensure the red highlighting logic for the highest probability disease continues to work with the dynamically calculated values."
        }
      ]
    }
  ]
}