{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Revert to Version 17 codebase",
  "requirements": [
    {
      "id": "REQ-135",
      "summary": "Remove all multi-class disease classification features added in Version 18 and Version 19",
      "acceptanceCriteria": [
        "frontend/src/utils/diseaseClassifier.ts is removed",
        "frontend/src/components/FeatureImportance.tsx is removed",
        "frontend/src/components/DiagnosticReasoning.tsx is removed",
        "All extended input fields added in Version 18/19 are removed from RiskPredictionPanel and GovernmentDataPanel",
        "DiseaseClassification component reverted to Version 17 logic showing only 4 diseases (Cholera, Typhoid, Dysentery, Hepatitis A)"
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/diseaseClassifier.ts",
          "operation": "delete",
          "description": "Remove the multi-class disease classification utility that was added in Version 18, which calculates probabilities for 7 diseases using XGBoost-inspired scoring logic with environmental parameters, water quality metrics, and symptom data"
        },
        {
          "path": "frontend/src/components/FeatureImportance.tsx",
          "operation": "delete",
          "description": "Remove the feature importance visualization component that displays horizontal bar charts showing the relative importance of input features in disease prediction, which was added in Version 18"
        },
        {
          "path": "frontend/src/components/DiagnosticReasoning.tsx",
          "operation": "delete",
          "description": "Remove the diagnostic reasoning component that displays contributing factors, predicted disease, and confidence scores for disease predictions, which was added in Version 18"
        }
      ]
    },
    {
      "id": "REQ-136",
      "summary": "Restore GovernmentDataPanel to Version 17 state with original 15 input fields only",
      "acceptanceCriteria": [
        "GovernmentDataPanel contains exactly 15 input fields as specified",
        "No symptom-based fields (diarrhea, fever, jaundice, bloody stool, skin rash) are present",
        "No extended water quality fields (fecal coliform, WQI) are present",
        "Update & Recalculate Risk button functions as in Version 17"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/GovernmentDataPanel.tsx",
          "operation": "modify",
          "description": "Revert to Version 17 state with only 15 input fields: Ward, Rainfall, 7-day avg rainfall, Humidity, 7-day avg humidity, Turbidity, Bacteria Index, Sanitation Coverage, Water Treatment Coverage, Population Density, Reported Cases, Water Source Type, Chlorination Status, PHC Capacity, Emergency Response Status. Remove all symptom-based fields (diarrhea, fever, jaundice, bloody stool, skin rash) and extended water quality fields (fecal coliform, WQI, primary season, water source, treatment status) that were added in Version 18/19. Remove any calls to diseaseClassifier utility. Ensure the component uses only the original 7-day moving average calculation and risk prediction logic without multi-class disease classification"
        }
      ]
    },
    {
      "id": "REQ-137",
      "summary": "Restore RiskPredictionPanel to Version 17 state for Hospital/PHC view",
      "acceptanceCriteria": [
        "RiskPredictionPanel contains only 8 input fields as specified",
        "No symptom-based input fields are present",
        "No extended water quality fields are present",
        "Component functions as in Version 17"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/RiskPredictionPanel.tsx",
          "operation": "modify",
          "description": "Revert to Version 17 state with only 8 input fields: Rainfall, Humidity, Turbidity, Bacteria Index, Reported Cases, Sanitation Coverage, Water Treatment Coverage, Population Density. Remove all symptom-based input fields (diarrhea, fever, jaundice, bloody stool, skin rash) and extended water quality fields (fecal coliform, WQI, primary season, water source, treatment status) that were added in Version 18/19. Remove any calls to diseaseClassifier utility and restore the original simple prediction logic that only uses the 4 core environmental parameters"
        }
      ]
    },
    {
      "id": "REQ-138",
      "summary": "Restore DiseaseClassification component to Version 17 state showing only 4 diseases",
      "acceptanceCriteria": [
        "Component displays exactly 4 disease probabilities",
        "No Giardiasis, Leptospirosis, or No Disease categories are shown",
        "Uses Version 17 calculation formula without XGBoost-inspired scoring",
        "Bar chart and pie chart visualizations work correctly"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/DiseaseClassification.tsx",
          "operation": "modify",
          "description": "Revert to Version 17 state showing probability distribution for only 4 diseases: Cholera, Typhoid, Dysentery, Hepatitis A. Remove Giardiasis, Leptospirosis, and No Disease categories that were added in Version 18. Replace the Version 18/19 XGBoost-inspired scoring logic with the simple Version 17 calculation formula based only on rainfall, humidity, turbidity, and bacteria index parameters. Remove event listener for 'disease-classification-updated' events and confidence score display. Ensure bar chart and pie chart visualizations display only the 4 original diseases"
        }
      ]
    },
    {
      "id": "REQ-139",
      "summary": "Restore DashboardPage to Version 17 state removing FeatureImportance and DiagnosticReasoning components",
      "acceptanceCriteria": [
        "FeatureImportance component is not rendered anywhere",
        "DiagnosticReasoning component is not rendered anywhere",
        "All three role views (Common Citizen, Hospital/PHC, Government) function exactly as in Version 17",
        "Component layout and ordering matches Version 17"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/DashboardPage.tsx",
          "operation": "modify",
          "description": "Revert to Version 17 state by removing all imports and rendering of FeatureImportance and DiagnosticReasoning components. Ensure all three role-based views (Common Citizen, Hospital/PHC, Government Health Authority) render only the components that existed in Version 17. Verify component layout and ordering matches Version 17 structure without any Version 18/19 additions"
        }
      ]
    },
    {
      "id": "REQ-140",
      "summary": "Restore AlertHistory component to Version 17 state with original columns",
      "acceptanceCriteria": [
        "No Confidence column is present (added in Version 18)",
        "Disease Prediction shows only Cholera, Typhoid, Dysentery, or Hepatitis A",
        "Filtering and sorting work as in Version 17"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AlertHistory.tsx",
          "operation": "modify",
          "description": "Revert to Version 17 state with columns: Date & Time, Ward, Rainfall, Humidity, Turbidity, Bacteria, Sanitation %, Water Treatment %, Risk Level, Risk %, Disease Most Likely, Priority Score, Email Sent, Recommended Action. Remove the Confidence column that was added in Version 18. Ensure Disease Prediction column displays only one of the 4 original diseases (Cholera, Typhoid, Dysentery, Hepatitis A) without any Version 18/19 diseases. Verify filtering and sorting functionality matches Version 17 behavior"
        }
      ]
    },
    {
      "id": "REQ-134",
      "summary": "Verify and document that frontend codebase matches Version 17 state exactly",
      "acceptanceCriteria": [
        "All frontend components match Version 17 state exactly",
        "All backend functions match Version 17 state exactly",
        "No Version 18 or Version 19 features remain in the codebase",
        "Application functions identically to Version 17"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Review and ensure the App component matches Version 17 state, verifying that route configuration, role selection logic, and logout functionality are identical to Version 17 without any Version 18/19 modifications"
        },
        {
          "path": "frontend/src/services/EmailAlertService.ts",
          "operation": "modify",
          "description": "Verify the EmailAlertService matches Version 17 implementation, ensuring it uses only the original environmental parameters and disease categories without any Version 18/19 symptom data or extended water quality metrics in email templates. Maintain the existing EmailJS configuration credentials (service_hf3e6oq, template_3dldpfg, KHu3JNagtUgZCsDcG) as specified in constraints"
        },
        {
          "path": "frontend/src/utils/wardRiskCalculator.ts",
          "operation": "modify",
          "description": "Verify the ward risk calculator matches Version 17 implementation, ensuring vulnerability multipliers and risk calculation formulas use only the original parameters without any Version 18/19 additions for symptom tracking or extended water quality metrics"
        }
      ]
    }
  ]
}